import leetcode1365 as lc1365 #有多少小于当前数字的数字
import leetcode88 as lc88 #合并两个有序数组
import leetcode14 as lc14 #最长公共前缀
import leetcode11 as lc11 #盛最多水的容器
import leetcode866 as lc866 #盛最多水的容器
import leetcode1207 as lc1207 #独一无二的出现次数
import leetcode859 as lc859 #859. 亲密字符串
#129.求根到叶子节点数字之和
#463. 岛屿的周长
#349. 两个数组的交集
#61. 旋转链表
#941. 有效的山脉数组
import leetcode122 as lc122 #买卖股票的最佳时机 II
#973. 最接近原点的 K 个点
#1010. 总持续时间可被 60 整除的歌曲
#922. 按奇偶排序数组 II
#1122. 数组的相对排序
#1030. 距离顺序排列矩阵单元格
#134. 加油站
#283. 移动零
#147. 对链表进行插入排序
#242. 有效的字母异位词
#452. 用最少数量的箭引爆气球
#剑指 Offer 42. 连续子数组的最大和
#222. 完全二叉树的节点个数
#1370. 上升下降字符串
#164. 最大间距
#976. 三角形的最大周长
#861. 翻转矩阵后的得分
#860. 柠檬水找零
#509. 斐波那契数
#738. 单调递增的数字
#290. 单词规律
#714. 买卖股票的最佳时机含手续费
#LCP 18. 早餐组合
#389. 找不同
#49. 字母异位词分组
test=lc122.Solution2()
res=test.maxProfit([7,1,5,3,6,5,7,9,10,12,15,16,18,19,20,4])
print(res)